{
  "service_map": {
    "ssl/https": "https",
    "ssl/http": "https",
    "https?": "https",
    "http-alt": "http",
    "http": "http",
    "mysql": "mysql",
    "redis": "redis",
    "mongodb": "mongodb",
    "vnc": "vnc",
    "rdp": "rdp",
    "docker": "docker",
    "kubernetes": "kubernetes",
    "elasticsearch": "elasticsearch",
    "smtp": "smtp",
    "ftp": "ftp",
    "telnet": "telnet",
    "dns": "dns",
    "ntp": "ntp",
    "snmp": "snmp",
    "ldap": "ldap",
    "couchdb": "couchdb",
    "ssh": "ssh",
    "smb": "smb",
    "pop3": "pop3",
    "tftp": "tftp",
    "mssql": "mssql",
    "oracle": "oracle",
    "postgresql": "postgresql",
    "nfs": "nfs",
    "memcached": "memcached",
    "ssdp": "ssdp",
    "rtsp": "rtsp",
    "webmin": "webmin",
    "jupyter": "jupyter",
    "rabbitmq": "rabbitmq",
    "sip": "sip",
    "sip-tls": "sip-tls",
    "kerberos": "kerberos",
    "mqtt": "mqtt",
    "apache": "apache",
    "nginx": "nginx",
    "openssh": "openssh",
    "vsftpd": "vsftpd",
    "phpmyadmin": "phpmyadmin",
    "openssl": "openssl",
    "apache tomcat": "tomcat",
    "tomcat": "tomcat",
    "dropbear": "dropbear",
    "varnish": "varnish",
    "php": "php",
    "jenkins": "jenkins"
  },

  "rules": [
  {
    "ports": [21],
    "service": "ftp",
    "severity": "High",
    "message": "FTP detected",
    "insight": "Disable FTP and use a secure alternative such as SFTP or FTPS because this website allows FTP connections that send usernames and passwords in plain text. An attacker who intercepts the traffic can steal login details and gain access to website files, which may result in defaced pages, stolen data, or the site being taken offline."
  },
  {
    "ports": [23],
    "service": "telnet",
    "severity": "High",
    "message": "Telnet detected",
    "insight": "Disable Telnet and use SSH instead because this website allows Telnet connections that do not encrypt data. Usernames, passwords, and commands can be intercepted by anyone on the network, allowing unauthorized access and changes that could compromise the website or its data."
  },
  {
    "ports": [25],
    "service": "smtp",
    "severity": "Medium",
    "message": "SMTP detected",
    "insight": "Restrict or secure SMTP access by enabling authentication and encryption because this website has an open SMTP service that can be misused. Attackers may send spam or fake emails from the site, leading to phishing attacks, reputation damage, or the domain being blacklisted and affecting legitimate email delivery."
  },
  {
    "ports": [53],
    "service": "dns",
    "severity": "High",
    "message": "DNS service detected",
    "insight": "Restrict DNS access to trusted servers and disable open recursion because this website has a DNS service accessible over the network. Attackers can abuse open DNS to redirect traffic, launch amplification attacks, or gather information about the domain, which may cause the site to become slow, unreachable, or easier to attack."
  },
  {
    "ports": [80],
    "service_contains": "http",
    "severity": "Medium",
    "message": "HTTP service detected",
    "insight": "Force all HTTP traffic to redirect to HTTPS and disable unnecessary HTTP access because this website is accessible over HTTP. Unencrypted traffic can be intercepted or modified, and outdated pages or applications exposed over HTTP may be abused to steal information or disrupt the site."
  },
  {
    "ports": [110],
    "service": "pop3",
    "severity": "High",
    "message": "POP3 detected",
    "insight": "Disable plain POP3 and use POP3S or IMAPS instead because this website allows POP3 connections that do not encrypt login details. Usernames and passwords can be intercepted on the network, allowing attackers to access emails, expose sensitive information, or use the account for further attacks."
  },
  {
    "ports": [123],
    "protocol": ["udp"],
    "service": "ntp",
    "severity": "High",
    "message": "NTP service detected",
    "insight": "Restrict NTP access to trusted IPs and disable monlist or other amplification features because this website has an NTP service accessible over the network. Open NTP can be abused for amplification attacks and may leak timing information, which can impact website performance, availability, and aid further attacks."
  },
  {
    "ports": [139, 445],
    "severity": "Critical",
    "message": "SMB service detected",
    "insight": "Disable SMB exposure to the public network or restrict it to internal access only because this website has SMB services open. Exposed SMB can allow attackers to access or modify files, spread malware, or deploy ransomware, putting website data and server stability at serious risk."
  },
  {
    "ports": [161],
    "protocol": ["udp"],
    "service": "snmp",
    "severity": "High",
    "message": "SNMP detected",
    "insight": "Restrict SNMP access to trusted hosts and use strong community strings because this website has SNMP accessible over the network. Exposed SNMP can reveal server details, network structure, and running services, giving attackers information to identify vulnerabilities and plan attacks that could compromise the website or its systems."
  },
  {
    "ports": [3306],
    "service": "mysql",
    "severity": "High",
    "message": "MySQL detected",
    "insight": "Restrict MySQL access to the application server only and enforce strong authentication because this website has a MySQL database service accessible from the network. An exposed database can be targeted by attackers to read, modify, or delete data, leading to stolen user information, broken website functions, or permanent data loss."
  },
  {
    "ports": [3389],
    "service": "rdp",
    "severity": "High",
    "message": "RDP detected",
    "insight": "Restrict RDP access to trusted IPs and use strong authentication or a VPN because this website’s server allows remote desktop access. Exposed RDP can be targeted by attackers to guess or steal login details, potentially letting them modify website files, install malware, or fully take control of the server."
  },
  {
    "ports": [389, 636],
    "service": "ldap",
    "severity": "High",
    "message": "LDAP service detected",
    "insight": "Restrict LDAP access to internal networks and require secure authentication and encryption because this website’s server exposes an LDAP service. An unsecured LDAP service can reveal usernames, group details, and directory information, making it easier for attackers to target accounts or attempt further access to the system."
  },
  {
    "ports": [5900],
    "service": "vnc",
    "severity": "High",
    "message": "VNC detected",
    "insight": "Restrict VNC access to trusted IPs and require strong authentication or a VPN because this website’s server has a VNC service open. Weak or exposed VNC access can allow attackers to view and control the server, change website content, access sensitive data, or take full control of the system."
  },
  {
    "ports": [6379],
    "service": "redis",
    "severity": "High",
    "message": "Redis detected",
    "insight": "Restrict Redis access to trusted hosts and enable authentication because this website has a Redis service open on the network. Unprotected Redis can allow attackers to read, modify, or delete data, potentially causing information leaks, disrupted website functionality, or loss of critical data."
  },
  {
    "ports": [27017],
    "service": "mongodb",
    "severity": "High",
    "message": "MongoDB detected",
    "insight": "Restrict MongoDB access to trusted hosts and enable authentication because this website has a MongoDB service accessible over the network. An unprotected database can allow attackers to access or delete data, leading to sensitive information leaks, disrupted website functionality, or permanent data loss."
  },
  {
    "ports": [5984],
    "service": "couchdb",
    "severity": "High",
    "message": "CouchDB detected",
    "insight": "Restrict CouchDB access to trusted hosts and enable authentication because this website has a CouchDB service open to the network. An unsecured database can allow attackers to access, modify, or delete documents, resulting in sensitive information exposure, website disruptions, or loss of important content."
  },
  {
    "ports": [8080, 443],
    "service_contains": "http",
    "severity": "Medium",
    "message": "Web management interface detected",
    "insight": "Restrict access to the web management interface to trusted IPs and enforce strong authentication because this website has a management interface accessible over HTTP and HTTPS. An exposed or unsecured interface can allow attackers to log in, modify website content, access sensitive data, or disrupt services."
  },
  {
    "ports": [9200],
    "service": "elasticsearch",
    "severity": "Critical",
    "message": "Elasticsearch detected",
    "insight": "Restrict Elasticsearch access to trusted hosts and enable authentication because this website has an Elasticsearch service open on the network. Publicly accessible Elasticsearch can allow attackers to read, modify, or delete data, leading to sensitive information exposure, loss of website content, or service disruption."
  },
  {
    "ports": [2375],
    "service": "docker",
    "severity": "Critical",
    "message": "Docker API detected",
    "insight": "Restrict Docker API access to trusted hosts and require authentication because this website’s server has the Docker API exposed. An exposed API can allow attackers to control containers, modify services, or take over the host system, resulting in full website compromise, data loss, or unauthorized changes."
  },
  {
    "ports": [6443],
    "service": "kubernetes",
    "severity": "Critical",
    "message": "Kubernetes API detected",
    "insight": "Restrict Kubernetes API access to trusted hosts and enforce strong authentication because this website’s server exposes the Kubernetes API. An accessible API can allow attackers to manipulate workloads, deploy malicious containers, or take control of the environment, leading to unauthorized changes, data exposure, or full infrastructure compromise."
  },
  {
    "ports": [69],
    "protocol": ["udp"],
    "service": "tftp",
    "severity": "High",
    "message": "TFTP detected",
    "insight": "Restrict TFTP access to trusted hosts and disable it if not needed because this website has a TFTP service open. Unauthenticated access can allow anyone to read or upload files, leading to exposed or modified website data and potential service disruptions."
  },
  {
    "ports": [1433],
    "service": "mssql",
    "severity": "High",
    "message": "MS SQL detected",
    "insight": "Restrict MS SQL access to trusted hosts and enforce strong authentication because this website’s server exposes an MS SQL database. Attackers could guess or brute-force credentials, leading to stolen data, altered content, or site downtime."
  },
  {
    "ports": [1521],
    "service": "oracle",
    "severity": "High",
    "message": "Oracle database detected",
    "insight": "Restrict Oracle database access to trusted hosts and enable strong authentication because this website has an Oracle database accessible on the network. An unprotected database can allow attackers to view or modify sensitive data, risking information leaks or disruption of website functions."
  },
  {
    "ports": [5432],
    "service": "postgresql",
    "severity": "High",
    "message": "PostgreSQL detected",
    "insight": "Restrict PostgreSQL access to trusted hosts and enforce strong authentication because this website exposes a PostgreSQL database. Unauthorized access can allow attackers to read or modify data, leading to breaches, altered site content, or loss of important records."
  },
  {
    "ports": [2049],
    "service": "nfs",
    "severity": "High",
    "message": "NFS detected",
    "insight": "Restrict NFS shares to trusted hosts and require proper authentication because this website’s server has NFS shares accessible over the network. Exposed shares can allow attackers to access, copy, or modify files, leading to data leaks, defaced pages, or disruptions to website functionality."
  },
  {
    "ports": [11211],
    "protocol": ["udp"],
    "service": "memcached",
    "severity": "High",
    "message": "Memcached detected",
    "insight": "Restrict Memcached to localhost or trusted IPs and disable UDP if not required because this website has a Memcached service open using UDP. Exposed Memcached can be abused for amplification attacks or to access cached data, leading to data leaks, performance issues, or use in larger attacks against other systems."
  },
  {
    "ports": [1900],
    "protocol": ["udp"],
    "service": "ssdp",
    "severity": "Medium",
    "message": "SSDP detected",
    "insight": "Restrict SSDP access to internal networks and disable it if not needed because this website’s server has SSDP accessible over the network. Exposed SSDP can reveal details about connected devices and services, helping attackers map the network and identify weak points for targeted attacks against the website or server."
  },
  {
    "ports": [554],
    "service": "rtsp",
    "severity": "Medium",
    "message": "RTSP detected",
    "insight": "Restrict RTSP access to trusted hosts and require authentication because this website exposes an RTSP service for streaming media. An unsecured RTSP service can allow attackers to view or record live streams, intercept content, compromise privacy, or gather information for further attacks."
  },
  {
    "ports": [10000],
    "service_contains": "webmin",
    "severity": "High",
    "message": "Webmin detected",
    "insight": "Restrict Webmin access to trusted IPs and enforce strong authentication because this website’s server has a Webmin panel accessible over the network. An exposed management panel can allow attackers to log in, take full control of the system, make unauthorized changes, steal files, or fully compromise the website and server."
  },
  {
    "ports": [8888],
    "service_contains": "jupyter",
    "severity": "Medium",
    "message": "Jupyter service detected",
    "insight": "Restrict Jupyter access to trusted users and require strong authentication because this website exposes a Jupyter service. An accessible Jupyter interface can allow attackers to run code on the server, alter website content, steal data, or install malware, leading to full server compromise."
  },
  {
    "ports": [5672, 15672],
    "service_contains": "rabbitmq",
    "severity": "High",
    "message": "RabbitMQ detected",
    "insight": "Restrict RabbitMQ access to trusted hosts and enable authentication because this website has a RabbitMQ message broker open on the network. An unprotected broker can allow attackers to read or manipulate messages, leading to data leaks, altered workflows, or disruption of website functionality."
  },
  {
    "ports": [5060],
    "protocol": ["udp", "tcp"],
    "service": "sip",
    "severity": "Medium",
    "message": "SIP detected",
    "insight": "Restrict SIP access to trusted networks and require authentication and encryption because this website’s server exposes a SIP service. An accessible SIP service can allow attackers to intercept calls, eavesdrop on conversations, or make unauthorized calls, compromising privacy and enabling further attacks."
  },
  {
    "ports": [5061],
    "protocol": ["tcp"],
    "service": "sip-tls",
    "severity": "Medium",
    "message": "SIP-TLS detected",
    "insight": "Ensure SIP-TLS is properly configured with strong certificates and authentication because this website exposes SIP-TLS. Misconfigured secure SIP can still allow attackers to access calls or metadata, leading to intercepted communications, privacy breaches, or unauthorized use of the service."
  },
  {
    "ports": [88],
    "service": "kerberos",
    "severity": "High",
    "message": "Kerberos detected",
    "insight": "Restrict Kerberos access to trusted hosts and monitor authentication requests because this website’s server exposes a Kerberos service. An accessible Kerberos service can allow attackers to gather information about accounts or authentication processes, increasing the risk of login attacks, credential compromise, and unauthorized access to sensitive data."
  },
  {
    "ports": [1883],
    "service": "mqtt",
    "severity": "Medium",
    "message": "MQTT detected",
    "insight": "Restrict MQTT broker access to trusted hosts and enable authentication and encryption because this website has an MQTT broker open on the network. An unprotected broker can allow attackers to read or inject messages, leading to service disruptions, data exposure, or manipulation of connected systems."
  }
],


"version_rules": [
  {
    "service": "openssh",
    "min_version": "7.0",
    "severity": "High",
    "message": "OpenSSH outdated",
    "insight": "Update to the latest version of OpenSSH. This server is running an outdated OpenSSH version. Older versions may have known vulnerabilities that allow attackers to bypass authentication or execute commands, putting website servers at risk."
  },
  {
    "service": "apache",
    "min_version": "2.4.57",
    "severity": "Medium",
    "message": "Apache outdated",
    "insight": "Update to the latest version of Apache.The website uses an older Apache version. This may include security bugs that attackers could exploit to access site files or disrupt web services."
  },
  {
    "service": "nginx",
    "min_version": "1.18.0",
    "severity": "Medium",
    "message": "Nginx outdated",
    "insight": "Update to the latest version of Nginx. An outdated Nginx server may contain security flaws. Attackers could exploit them to intercept traffic, inject content, or cause service disruptions."
  },
  {
    "service": "mysql",
    "min_version": "8.0",
    "severity": "High",
    "message": "MySQL outdated",
    "insight": "Update to the latest version of MySQL. The database is running an older MySQL version. Attackers could exploit known vulnerabilities to access, modify, or delete website data."
  },
  {
    "service": "postgresql",
    "min_version": "13.0",
    "severity": "Medium",
    "message": "PostgreSQL outdated",
    "insight": "Update to the latest version of PostgreSQL. An outdated PostgreSQL server may allow attackers to access or manipulate website data using known vulnerabilities."
  },
  {
    "service": "vsftpd",
    "min_version": "3.0.0",
    "severity": "Critical",
    "message": "vsftpd outdated",
    "insight": "Update to the latest version of vsftpd. The FTP service is using an old vsftpd version with known backdoors. Attackers could gain full access to website files and server data."
  },
  {
    "service": "phpmyadmin",
    "min_version": "4.8.5",
    "severity": "High",
    "message": "phpMyAdmin outdated",
    "insight": "Update to the latest version of phpMyAdmin. Attackers could exploit vulnerabilities to access or modify website databases."
  },
  {
    "service": "openssl",
    "min_version": "1.1.1",
    "severity": "High",
    "message": "OpenSSL outdated",
    "insight": "Update to the latest version of OpenSSL. The server uses an older OpenSSL version. This could allow attackers to intercept or decrypt sensitive data sent to and from the website."
  },
  {
    "service": "apache tomcat",
    "min_version": "9.0",
    "severity": "High",
    "message": "Tomcat outdated",
    "insight": "Update to the latest version of Tomcat. The Tomcat server is outdated. Known vulnerabilities could allow attackers to execute commands or access web applications."
  },
  {
    "service": "dropbear",
    "min_version": "2022.83",
    "severity": "Medium",
    "message": "Dropbear outdated",
    "insight": "Update to the latest version of Dropbear. The server is running an older Dropbear SSH version. Attackers may exploit weaknesses to gain unauthorized server access."
  },
  {
    "service": "varnish",
    "min_version": "6.0",
    "severity": "Info",
    "message": "Varnish outdated",
    "insight": "Update to the latest version of Varnish. The Varnish cache version is old. If publicly accessible, attackers could exploit it to intercept or manipulate cached website content."
  },
  {
    "service": "docker",
    "min_version": "20.10.0",
    "severity": "High",
    "message": "Docker outdated",
    "insight": "Update to the latest version of Docker. The Docker engine is outdated. Attackers could exploit it to gain control over containers and potentially the host system running the website."
  },
  {
    "service": "kubernetes",
    "min_version": "1.27.0",
    "severity": "Critical",
    "message": "Kubernetes outdated",
    "insight": "Update to the latest version of Kubernetes. The Kubernetes cluster is running an older version. Attackers could exploit vulnerabilities to control workloads or access sensitive data."
  },
  {
    "service": "elasticsearch",
    "min_version": "7.17.0",
    "severity": "Critical",
    "message": "Elasticsearch outdated",
    "insight": "Update to the latest version of Elasticsearch. The Elasticsearch server is outdated. Attackers could read, modify, or delete website data stored in the search engine."
  },
  {
    "service": "rabbitmq",
    "min_version": "3.10.0",
    "severity": "High",
    "message": "RabbitMQ outdated",
    "insight": "Update to the latest version of RabbitMQ. The RabbitMQ service is running an old version. Attackers could access or manipulate messages, affecting website workflows or data integrity."
  },
  {
    "service": "redis",
    "min_version": "6.2.0",
    "severity": "High",
    "message": "Redis outdated",
    "insight": "Update to the latest version of Redis. The Redis server is outdated. Attackers could exploit weaknesses to access, modify, or delete stored website data."
  },
  {
    "service": "mongodb",
    "min_version": "6.0.0",
    "severity": "High",
    "message": "MongoDB outdated",
    "insight": "Update to the latest version of MongoDB. MongoDB is running an old version. Attackers could access or delete website data, risking data leaks or site disruption."
  },
  {
    "service": "couchdb",
    "min_version": "3.2.0",
    "severity": "High",
    "message": "CouchDB outdated",
    "insight": "Update to the latest version of CouchDB. The CouchDB server is outdated. Attackers could access sensitive documents or manipulate website data."
  },
  {
    "service": "php",
    "min_version": "8.2.0",
    "severity": "High",
    "message": "PHP outdated",
    "insight": "Update to the latest version of PHP. The website is using an old PHP version. Known vulnerabilities could allow attackers to execute code or access sensitive data."
  },
  {
    "service": "jenkins",
    "min_version": "2.401",
    "severity": "High",
    "message": "Jenkins outdated",
    "insight": "Update to the latest version of Jenkins. The Jenkins service is not up to date. Attackers could exploit vulnerabilities to modify deployments or access confidential configurations."
  },
  {
    "service": "tomcat",
    "min_version": "10.1.0",
    "severity": "High",
    "message": "Tomcat outdated",
    "insight": "Update to the latest version of Tomcat. The Tomcat server is running an old version. Attackers could exploit known flaws to execute code or compromise applications."
  }
],

  "defaults": {
    "severity": "Info",
    "message": "No specific rule matched. Review service/version manually."
  }
}