{
  "hostname_rule": [
    {
      "pattern": "(?i)(?:^|\\.)security(?:\\.|$)",
      "severity": "High",
      "message": "Hostname contains 'security' — review access controls, restrict exposure, and ensure strict authentication on this asset."
    },
    {
      "pattern": "(?i)(?:dev|development|sandbox)",
      "severity": "Medium",
      "message": "Development environment detected — limit public access, disable debug features, and separate it from production systems."
    },
    {
      "pattern": "(?i)(?:test|qa|uat)",
      "severity": "Medium",
      "message": "Test or QA environment found — remove external exposure and ensure no production data is present."
    },
    {
      "pattern": "(?i)(?:staging|preprod)",
      "severity": "Medium",
      "message": "Staging environment detected — restrict access to internal users and align security controls with production standards."
    },
    {
      "pattern": "(?i)(?:prod|production)",
      "severity": "Low",
      "message": "Production-labelled hostname — verify proper hardening, logging, and monitoring to reduce risk on critical assets."
    },
    {
      "pattern": "(?i)(?:internal|\\bint\\b|intra)",
      "severity": "High",
      "message": "Hostname indicates internal systems — ensure these are not reachable externally and enforce network segmentation."
    },
    {
      "pattern": "(?i)\\bdmz\\b",
      "severity": "Medium",
      "message": "DMZ-labelled hostname — confirm tight firewall rules, limited services, and proper isolation from internal networks."
    },
    {
      "pattern": "(?i)\\bapi\\b",
      "severity": "Low",
      "message": "API-related hostname — verify authentication, rate limiting, and version control to reduce misuse."
    },
    {
      "pattern": "(?i)(?:auth|login|identity)",
      "severity": "High",
      "message": "Authentication-related system detected — enforce MFA, validate TLS configuration, and restrict public access."
    },
    {
      "pattern": "(?i)(?:db|database|\\bsql\\b)",
      "severity": "High",
      "message": "Database-referenced hostname — ensure the database is not public, enforce firewall rules, and require strong authentication."
    },
    {
      "pattern": "(?i)(?:cache|redis|memcached)",
      "severity": "Medium",
      "message": "Cache-layer hostname — restrict network exposure and require authentication to prevent data leakage."
    },
    {
      "pattern": "(?i)(?:legacy|old|v1|deprecated)",
      "severity": "Medium",
      "message": "Legacy system detected — schedule an update, apply compensating controls, and review for outdated dependencies."
    },
    {
      "pattern": "(?i)(?:backup|\\bbk\\b|mirror)",
      "severity": "Medium",
      "message": "Backup or mirror system — ensure no sensitive data is publicly accessible and enforce strict access controls."
    },
    {
      "pattern": "(?i)(?:static|assets|cdn)",
      "severity": "Low",
      "message": "Static asset hostname — verify correct content-only exposure and ensure no backend files leak through this host."
    },
    {
      "pattern": "(?i)(?:mail|smtp|pop|imap)",
      "severity": "Medium",
      "message": "Mail-related host — enforce encrypted transport (TLS), block unauthenticated relays, and restrict admin interfaces."
    },
    {
      "pattern": "(?i)\\bvpn\\b",
      "severity": "High",
      "message": "VPN endpoint detected — require MFA, limit IP access where possible, and monitor for brute-force attempts."
    },
    {
      "pattern": "(?i)(?:admin|panel|dashboard)",
      "severity": "High",
      "message": "Administrative system detected — enforce strong authentication, IP restrictions, and minimize public exposure."
    },
    {
      "pattern": "(?i)(?:edge|gateway)",
      "severity": "Medium",
      "message": "Edge or gateway host — review ingress rules, validate TLS settings, and ensure no unnecessary open services."
    },
    {
      "pattern": "(?i)(?:k8s|kubectl|cluster)",
      "severity": "High",
      "message": "Cluster-related hostname — ensure Kubernetes control plane is not public and enforce RBAC and network restrictions."
    },
    {
      "pattern": "(?i)(?:worker|node|app\\d+)",
      "severity": "Low",
      "message": "Worker or node host — ensure these instances are internal-only and hardened according to baseline configurations."
    },
    {
      "pattern": "(?i)(?:ops|monitor|grafana|prometheus)",
      "severity": "Medium",
      "message": "Monitoring/operations system detected — restrict public access and require authentication for dashboards and metrics."
    }
  ],

  "defaults": {
    "severity": "Info",
    "message": "No hostname pattern matched — continue with routine checks and validate exposure based on role and function."
  }
}
